# Brewfile for macOS setup
# Install with: brew bundle

# CLI Tools
brew "fswatch"
brew "gh"
brew "git"
brew "git-lfs"
brew "tmux"
brew "vim"
brew "wget"
brew "watch"

# Development
brew "rbenv"
brew "python@3.13"
brew "jupyterlab"
brew "uv"
brew "rustup"

# VSCode Extensions
vscode "anthropic.claude-code"
vscode "github.vscode-github-actions"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "vscodevim.vim"
